app/views/welcome/living_supply_summary.html.erb

        <div class="12u">
          <%= column_chart Livingsupply.group(:item, :district).sum(:quantity), title: "Province Living Supply Distribution" %>
---
SELECT "livingsupplies".* FROM "livingsupplies" WHERE "livingsupplies"."district" = ?  [["district", "Matale"]]
SELECT SUM("livingsupplies"."quantity") AS sum_quantity, "livingsupplies"."item" AS livingsupplies_item, "livingsupplies"."district" AS livingsupplies_district FROM "livingsupplies" GROUP BY "livingsupplies"."item", "livingsupplies"."district"

        <div class="12u">
          <%= column_chart Livingsupply.group(:item, :province).sum(:quantity), title: "Province Living Supply Distribution" %>
---
SELECT SUM("livingsupplies"."quantity") AS sum_quantity, "livingsupplies"."item" AS livingsupplies_item, "livingsupplies"."province" AS livingsupplies_province FROM "livingsupplies" GROUP BY "livingsupplies"."item", "livingsupplies"."province"

    <% total_cal=[] %>
  <%Livingsupply.where(district: d.name).each do |liv|%>
    <%ical = liv.quantity * Livingitem.where(name: liv.item).last.cal%>
---
SELECT "livingsupplies".* FROM "livingsupplies" WHERE "livingsupplies"."district" = ?  [["district", "Kegalle"]]
SELECT "livingitems".* FROM "livingitems" WHERE "livingitems"."name" = ? ORDER BY "livingitems"."id" DESC LIMIT ?  [["name", "Meat"], ["LIMIT", 1]]

  {
    "type": "Feature",
    "properties": {"district": "<%= d.name %>", "value": "<%= (total_cal.sum/Province.where(name: d.name).first.population/2000/30.to_f).round(2) %>" },
    "geometry": {
---
SELECT "provinces".* FROM "provinces" WHERE "provinces"."name" = ? ORDER BY "provinces"."id" ASC LIMIT ?  [["name", "Kegalle"], ["LIMIT", 1]]