app/views/welcome/sirmodel.html.erb

        <div class="12u">
          <%= line_chart [
            {name: "Hospitalized", data: Covid19case.group(:notification_date).where(status: "Hospitalized").count, color: "Blue"},
            {name: "Recovered", data: Covid19case.group(:notification_date).where(status: "Recovered").count, color: "Green"},
            {name: "Dead", data: Covid19case.group(:notification_date).where(status: "Dead").count, color: "Red"}
          ],
          title: "Covid-19 Pandemic Timeline" %>
---
SELECT COUNT(*) AS count_all, "covid19cases"."notification_date" AS covid19cases_notification_date FROM "covid19cases" WHERE "covid19cases"."status" = ? GROUP BY "covid19cases"."notification_date"  [["status", "Hospitalized"]]

                <td>
                  Province : <%= select :province, params[:province], options_from_collection_for_select(Province.where(admlevel: "District").all.order(:name), :name, :pro_pop ), prompt: "- Please Select Province -"%>
---
SELECT "provinces".* FROM "provinces" WHERE "provinces"."admlevel" = ? ORDER BY "provinces"."name" ASC  [["admlevel", "District"]]