app/views/welcome/vaccine_register_summary.html.erb

SELECT COUNT(*) AS count_all, "vaccineregs"."gender" AS vaccineregs_gender FROM "vaccineregs" GROUP BY "vaccineregs"."gender"
---
        <div class="6u">
          <%= pie_chart Vaccinereg.group(:gender).count, title: "Gender Distirbution" %>

SELECT COUNT(*) AS count_all, "vaccineregs"."vaccinetype" AS vaccineregs_vaccinetype FROM "vaccineregs" GROUP BY "vaccineregs"."vaccinetype"
---
        <div class="6u">
          <%= pie_chart Vaccinereg.group(:vaccinetype).count, title: "Vaccine Distribution" %>

SELECT COUNT(*) AS count_all, "vaccineregs"."province" AS vaccineregs_province FROM "vaccineregs" GROUP BY "vaccineregs"."province"
---
        <div class="12u">
          <%= column_chart Vaccinereg.group(:province).count, title: "Covid-19 Vaccination Distribution" %>

SELECT COUNT(*) FROM "vaccineregs" WHERE "vaccineregs"."province" = ?  [["province", "Kegalle"]]
---
  <% @provinces.each do |p| %>
    <% reg_value = Vaccinereg.where(province: p.name).count rescue nil %>