app/views/vaccineregs/_form.html.erb

    Vaccine Type:
    <%= form.select :vaccinetype, options_from_collection_for_select(Vaccine.all.order(:id), :name, :name, form.object.vaccinetype), prompt: "- Please Select vaccine - "%>
---
SELECT "vaccines".* FROM "vaccines" ORDER BY "vaccines"."id" ASC

    Province:
    <%= form.select :province, options_from_collection_for_select(Province.all.order(:name), :name, :name), include_blank: true %>
---
SELECT "provinces".* FROM "provinces" ORDER BY "provinces"."name" ASC