app/controllers/application_controller.rb

  def set_variables

    @countryinfo = Countryinfo.all

    if @countryinfo.size > 0

      @country_name = @countryinfo.first.name
---
SELECT COUNT(*) FROM "countryinfos"
SELECT "countryinfos".* FROM "countryinfos" ORDER BY "countryinfos"."id" ASC LIMIT ?  [["LIMIT", 1]]