app/controllers/livingsupplies_controller.rb

  def index
    @livingsupplies = Livingsupply.all
---
SELECT "livingsupplies".* FROM "livingsupplies"

  def create
    @livingsupply = Livingsupply.new(livingsupply_params)

    respond_to do |format|
      if @livingsupply.save
---
INSERT INTO "livingsupplies" ("date", "item", "quantity", "province", "remark", "created_at", "updated_at", "district") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

    def set_livingsupply
      @livingsupply = Livingsupply.find(params[:id])
---
SELECT "livingsupplies".* FROM "livingsupplies" WHERE "livingsupplies"."id" = ? LIMIT ?  [["id", 65], ["LIMIT", 1]]