app/controllers/vaccineregs_controller.rb

  def index
    @vaccineregs = Vaccinereg.all
---
SELECT "vaccineregs".* FROM "vaccineregs"

  def update
    respond_to do |format|
      if @vaccinereg.update(vaccinereg_params)
---
UPDATE "vaccineregs" SET "gender" = ?, "province" = ?, "vaccinetype" = ?, "vaccinelotno" = ?, "updated_at" = ? WHERE "vaccineregs"."id" = ?  [["gender", "Female"], ["province", ""], ["vaccinetype", "Sputnik"], ["vaccinelotno", "43524524543"], ["updated_at", "2022-01-20 05:52:55.808711"], ["id", 4]]

    def set_vaccinereg
      @vaccinereg = Vaccinereg.find(params[:id])
---
SELECT "vaccineregs".* FROM "vaccineregs" WHERE "vaccineregs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]