app/controllers/welcome_controller.rb

  def sir_output

    sdate = params[:s_date]

    edate = params[:e_date]

    days = params[:days].first.to_i

    @province = params[:province].first.to_s

    @s = params[:susceptible].first.to_i

    @beta = params[:beta].first.to_f

    @gamma = params[:gamma].first.to_f

    @lambda = params[:lambda].first.to_f

    @delta = params[:delta].first.to_f

    @population = Province.where(name: @province).first.population
---
SELECT "provinces".* FROM "provinces" WHERE "provinces"."name" = ? ORDER BY "provinces"."id" ASC LIMIT ?  [["name", "Jaffna"], ["LIMIT", 1]]

    s = @s

    # Infected
    i = @i = Covid19case.where(notification_date: @date_range, status: "Hospitalized", qua_district: @province).count

    # Recovered
    r = @r = Covid19case.where(notification_date: @date_range, status: "Recovered", qua_district: @province).count

    # Dead
    d = @d = Covid19case.where(notification_date: @date_range, status: "Dead", qua_district: @province).count
---
SELECT COUNT(*) FROM "covid19cases" WHERE "covid19cases"."notification_date" IN (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?) AND "covid19cases"."status" = ? AND "covid19cases"."qua_district" = ?

  def summary

    @search_range = params["ranges"]

    sdate = @search_range["s_date"] rescue nil

    edate = @search_range["e_date"] rescue nil

    #sdate = params[:s_date] rescue nil
    #edate = params[:e_date] rescue nil

    @sdate = sdate rescue nil

    @edate = edate rescue nil

    @date_range = (@sdate .. @edate).to_a rescue nil

    @districts = Province.where(admlevel: "District").all

    @provinces = Province.where(admlevel: "Province").all

    if @date_range.blank?
      @summary_cases = Covid19case.order(:notification_date).all rescue nil
      @start_date = @summary_cases.first.notification_date rescue nil
      @end_date = @summary_cases.last.notification_date rescue nil
---
SELECT "provinces".* FROM "provinces" WHERE "provinces"."admlevel" = ?  [["admlevel", "District"]]
SELECT "covid19cases".* FROM "covid19cases" ORDER BY "covid19cases"."notification_date" DESC LIMIT ?  [["LIMIT", 1]]
SELECT "covid19cases".* FROM "covid19cases" ORDER BY "covid19cases"."notification_date" ASC LIMIT ?  [["LIMIT", 1]]

  def living_supply_summary

    @districts = Province.where(admlevel: "District").all
---
SELECT "provinces".* FROM "provinces" WHERE "provinces"."admlevel" = ?  [["admlevel", "District"]]

  def vaccine_register_summary
    @provinces = Province.all
---
SELECT "provinces".* FROM "provinces"