app/views/livingsupplies/_form.html.erb

SELECT "livingitems".* FROM "livingitems" ORDER BY "livingitems"."name" ASC
---
		<td>
                  <%= form.select :item, options_from_collection_for_select(Livingitem.all.order(:name), :name, :item_unit, form.object.item ), prompt: "- Please Select Item -", required: true %>

SELECT "provinces".* FROM "provinces" WHERE "provinces"."admlevel" = ? ORDER BY "provinces"."name" ASC  [["admlevel", "Province"]]
---
		<td>
		    <%= form.select :province, options_from_collection_for_select(Province.where( admlevel: "Province").all.order(:name), :name, :name, form.object.province), prompt: "- Please Select Province -", required: true %>

SELECT "provinces".* FROM "provinces" WHERE "provinces"."admlevel" = ? ORDER BY "provinces"."name" ASC  [["admlevel", "District"]]
---
		<td>
		    <%= form.select :district, options_from_collection_for_select(Province.where(admlevel: "District").all.order(:name), :name, :name, form.object.district), prompt: "- Please Select District -", required: true %>