app/views/livingsupplies/index.html.erb

SELECT "livingitems".* FROM "livingitems" WHERE "livingitems"."name" = ? ORDER BY "livingitems"."id" ASC LIMIT ?  [["name", "Meat"], ["LIMIT", 1]]
---
        <td><%= livingsupply.quantity %></td>
        <td><%= Livingitem.where(name: livingsupply.item).first.unit rescue nil %></td>