app/views/livingsupplies/show.html.erb

  <strong>Unit:</strong>
  <%= Livingitem.where(name: @livingsupply.item).first.unit %>
---
SELECT "livingitems".* FROM "livingitems" WHERE "livingitems"."name" = ? ORDER BY "livingitems"."id" ASC LIMIT ?  [["name", "Water"], ["LIMIT", 1]]