app/views/layouts/application.html.erb

SELECT "indexpages".* FROM "indexpages" WHERE "indexpages"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---

<% indextxt =  Indexpage.find_by(id: 1) %>