app/views/layouts/summary.html.erb


<% indextxt =  Indexpage.find_by(id: 1) %>
---
SELECT "indexpages".* FROM "indexpages" WHERE "indexpages"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]